Merge pull request #1 from privacynow/feature/postgres_for_data_store
Feature/postgres for data store
